[
    {
        "id": 1,
        "title": "Google Books",
        "image": "https://user-images.githubusercontent.com/69410816/107121727-03840700-6862-11eb-8731-43f4730be600.png",
        "description": "The Google Books application I created allows a user to search for any book they want using the google books API. A user can search for a book, save a book theyre interested in, go to the saved page to see their list of saved books and view the book they saved by clicking the view button that redirects them to googles page where they can see more info about the book or buy it.",
        "link": "https://pacific-island-39743.herokuapp.com/",
        "code": "https://github.com/goobisanubis21/google-books"
    },
    {
        "id": 2,
        "title": "Eat The Burger",
        "image": "https://user-images.githubusercontent.com/69410816/101261112-c638b700-3702-11eb-86e5-21babbade94f.png",
        "description": "The burger app is a user friendly web application that allows a user to create their own burgers. User can type the name of their burger into the input field and when clicking on the submit button the burger will be added to the mysql database. It will then refresh the page so that the burger will be added to the list of burgers below. User will then have the option to devour a burger which will then, updating the database, move the devoured burger over to the devoured section. Once in the devoured section the user will have the option to delete the burger which will completely drop it from the database and no longer be viewed on the page. This application uses the mysql package along with the express package.",
        "link": "https://dry-wildwood-56416.herokuapp.com/",
        "code": "https://github.com/goobisanubis21/burger"
    },
    {
        "id": 3,
        "title": "Employee Directory",
        "image": "https://user-images.githubusercontent.com/69410816/105644374-42c65700-5e63-11eb-9875-0b5542ee25c3.png",
        "description": "The employee directory app allows a user to see a list of all the employees in there company. They are able to start typing in the search bar in order to filter out who the dont want too see depending upon what letters they type. User is also able to sort the list in alphabetical order by first name at the click of a button. This app is written in ReactJs using the node package axios.",
        "link": "https://goobisanubis21.github.io/employeedirectory/",
        "code": "https://github.com/goobisanubis21/employeedirectory"
    },
    {
        "id": 4,
        "title": "Hangman",
        "image": "https://user-images.githubusercontent.com/69410816/102934841-f1493780-4472-11eb-9b25-bef8bcb5bbc1.png",
        "description": "Introducing HANGDOUT, a revolutionary way to play, collaborate, and learn alongside your peers! Upon entering the application, the user is greeted with a sign up page where they will create a username pior to entering the home page. We have implemented words derived from the Scholastic Aptitude Test in our hang man game which will allow the user to familiarize themselves with the word stack. After playing a game of hang man, the score of the user will be stored in a leaderboard which they can keep track of. The leaderboards will incorporate a ranking system that lets individuals compete in order to obtain the highest score. The vocabulary words have been strategically selected to engage our users of all age groups, especially those who are preparing to take their Scholastic Aptitude Test (SAT). Users will be able to edit and remove their profiles as they please which will remove all of their statistics including high scores and win streaks from the application.",
        "link": "https://projectnumtwo2.herokuapp.com/login",
        "code": "https://github.com/goobisanubis21/projectTwo"
    },
    {
        "id": 5,
        "title": "Weather",
        "image": "https://user-images.githubusercontent.com/69410816/96387274-ce4a9080-116e-11eb-82f6-85d6d30f90f8.png",
        "description": "The weather dashboard app is design to give a user friendly and simple experience to check the weather conditions in any searched area. Upon searching a certain area which gets displayed, the app allows user to see the current date, temp in Fahrenheit, humidity, wind speed and uv index. It also allows user to see the 5 day forecast for the searched area. All searches are prepended into a search history list that appears beneath the search bar which allows user to click on any old searches to quickly view all the data.",
        "link": "https://goobisanubis21.github.io/weather/",
        "code": "https://github.com/goobisanubis21/weather"
    },
    {
        "id": 6,
        "title": "Lyric Finder",
        "image": "https://user-images.githubusercontent.com/69410816/97770007-e83c8980-1b05-11eb-9c10-5b3874ad737d.png",
        "description": "The lyric finder app allows users to search for an artist and any song by that artist to veiw your results. Upon entering the artist name and corresponding song of the users choice, the user will be redirected to the results page where the lyrics of that specific song plus the most up to date bio on the artist will be displayed. Two Api's were used for the app in order to render results. The api used to get the arist bio is from audio scrobbler and for the lyrics is from musix match.",
        "link": "https://goobisanubis21.github.io/project1-lyricFinder/",
        "code": "https://github.com/goobisanubis21/project1-lyricFinder"
    },
    {
        "id": 7,
        "title": "Daily Planner",
        "image": "https://user-images.githubusercontent.com/69410816/96191976-26855680-0f13-11eb-9913-1abfd56dac54.png",
        "description": "The daily planner home work is a simple tasks organizer. The current time of day will be highlighted in red, the future times in green and the past are in the default color. It allows the user to type in a task in a time block in the normal 9 to 5 work day, save that task into local storage and then have it displayed to the user whether you refresh the page or even close out the brower window entirely. It also shows the current day month and year.",
        "link": "https://goobisanubis21.github.io/calendar/",
        "code": "https://github.com/goobisanubis21/calendar"
    }
]